app/controllers/events_controller.rb

  def create
    @item = Item.find_by_key(params[:key])
---
SELECT * FROM "items" WHERE ("items"."key" = 'df4fac63f77f6896bb09d3b8f01441f7') LIMIT 1