app/controllers/items_controller.rb

  def index
    render :action => 'public_index' unless session[:authorized]

    @items = Item.find(:all, :include => [:events])
---
SELECT "events".* FROM "events" WHERE ("events".item_id IN (1,2))

  def show
    @item = Item.find_by_key(params[:key])
---
SELECT * FROM "items" WHERE ("items"."key" = 'df4fac63f77f6896bb09d3b8f01441') LIMIT 1